{
  "description": "<p>Current version: <a href=\"https://github.com/GLAM-Workbench/recordsearch/releases/tag/v1.1.0\">v1.1.0</a></p> <p>This repository contains Jupyter notebooks to work with data from the National Archives of Australia’s RecordSearch database.</p> <p><a href=\"https://recordsearch.naa.gov.au/\">RecordSearch</a> is the online collection database of the National Archives of Australia. Based on the <a href=\"https://www.naa.gov.au/help-your-research/getting-started/commonwealth-record-series-crs-system\">series system</a>, RecordSearch provides rich, contextual information about series, items, agencies, and functions.</p> <p>Unfortunately RecordSearch doesn’t provide access to machine-readable data through an API, so we have to resort to screen scraping. The notebooks here make use of the <a href=\"https://wragge.github.io/recordsearch_data_scraper/\">RecordSearch Data Scraper</a>.</p> <p>See the <a href=\"https://glam-workbench.net/recordsearch/\">RecordSearch section</a> of the GLAM Workbench for more details.</p> <h2 id=\"notebook-topics\">Notebook topics</h2> <h3 id=\"harvesting-data\">Harvesting data</h3> <ul> <li><strong>Harvest items from a search in RecordSearch</strong> – save the results of an item search in RecordSearch as a downloadable dataset, you can also save images and PDFs from digitised files</li> <li><strong>Harvest files with the access status of ‘closed’</strong> – find out what we’re not allowed to see by harvesting details of ‘closed’ files</li> <li><strong>Harvest recently digitised files from RecordSearch</strong> – save details of files digitised in the past month</li> <li><strong>Harvest details of all series in RecordSearch</strong> – get details of all series registered in RecordSearch, also generates a summary dataset with the total number of items digitised, described and in each access category</li> <li><strong>Harvesting functions from the RecordSearch interface</strong> – extract information from the RecordSearch interface about the hierarchy of functions it uses to describe the work of government agencies</li> <li><strong>Harvest agencies associated with <em>all</em> functions</strong> – loops through the list of functions saving details of the agencies associated with each</li> </ul> <h3 id=\"analysing-data\">Analysing data</h3> <ul> <li><strong>Exploring harvested series data, 2021</strong> – generates some basic statistics from the harvest of series data</li> <li><strong>Exploring harvested series data, 2022</strong> – generates some basic statistics from the harvest of series data in 2022 and compares the results to the previous year</li> <li><strong>Summary of records digitised in the previous week</strong> – run this notebook to analyse the most recent dataset of recently digitised files, summarising the results by series</li> <li><strong>How many of the functions are actually used?</strong> – looks at the harvest of functions to see how many are actually in use</li> <li><strong>Who’s responsible?</strong> – pick a function to which which agencies are have been responsible for it over time</li> </ul> <h3 id=\"useful-tools\">Useful tools</h3> <ul> <li><strong>DIY Redaction Art Collages</strong> – generates a random sample of ASIO redactions and packs them into one big image</li> <li><strong>Download the contents of a digitised file</strong> – get a digitised files as a folder full of images</li> <li><strong>Get a list of agencies associated with a function</strong> - pick a function and create a downloadable list of agencies responsible for it</li> <li><strong>DFAT Cable Finder</strong> – helps you find numbered cables created by DFAT</li> </ul> <h2 id=\"data-downloads\">Data downloads</h2> <ul> <li><a href=\"https://github.com/GLAM-Workbench/recordsearch/blob/master/series_totals_May_2021.csv\">Summary data about all series in RecordSearch, May 2021</a> (15mb CSV) – contains basic descriptive information about all the series currently registered on RecordSearch (May 2021) as well as the total number of items described, digitised, and in each access category.</li> <li><a href=\"https://github.com/GLAM-Workbench/recordsearch/blob/master/series_totals_April_2022.csv\">Summary data about all series in RecordSearch, April 2022</a> (15mb CSV) – contains basic descriptive information about all the series currently registered on RecordSearch (May 2021) as well as the total number of items described, digitised, and in each access category.</li> <li><a href=\"https://github.com/GLAM-Workbench/recordsearch/blob/master/data/recently-digitised-20210327\">Recently digitised files</a> (CSV) – containing details of files digitised between 25 February and 26 March 2021, for an ongoing record of digitised files see <a href=\"https://github.com/wragge/naa-recently-digitised\">this repository</a> which creates weekly snapsots.</li> </ul> <h2 id=\"cite-as\">Cite as</h2> <p>See the GLAM Workbench or <a href=\"https://doi.org/10.5281/zenodo.3544753\">Zenodo</a> for up-to-date citation details.</p> <hr /> <p>This repository is part of the <a href=\"https://glam-workbench.github.io/\">GLAM Workbench</a>.<br /> If you think this project is worthwhile, you might like <a href=\"https://github.com/sponsors/wragge?o=esb\">to sponsor me on GitHub</a>.</p>",
  "license": "MIT",
  "title": "GLAM-Workbench/recordsearch",
  "version": "v1.1.0",
  "upload_type": "software",
  "keywords": [
    "RecordSearch",
    "National Archives of Australia",
    "digital humanities",
    "archives",
    "GLAM Workbench"
  ],
  "publication_date": "2022-06-27",
  "creators": [
    {
      "orcid": "0000-0001-7956-4498",
      "name": "Sherratt, Tim"
    }
  ],
  "access_right": "open",
  "related_identifiers": [
    {
      "scheme": "url",
      "identifier": "https://github.com/GLAM-Workbench/recordsearch/tree/v1.1.0",
      "relation": "isDerivedFrom",
      "resource_type": "software"
    },
    {
      "scheme": "url",
      "identifier": "https://glam-workbench.github.io/recordsearch/",
      "relation": "isDocumentedBy",
      "resource_type": "publication-softwaredocumentation"
    },
    {
      "scheme": "url",
      "identifier": "https://glam-workbench.github.io/",
      "relation": "isPartOf",
      "resource_type": "other"
    },
    {
      "scheme": "url",
      "identifier": "https://mybinder.org/v2/zenodo/10.5281/zenodo.3544754/",
      "relation": "isSourceOf",
      "resource_type": "other"
    }
  ]
}
